FIO-tests-15-49-03-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1609689007,
  "timestamp_ms" : 1609689007228,
  "time" : "Sun Jan  3 15:50:07 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 762134528,
        "io_kbytes" : 744272,
        "bw_bytes" : 25403637,
        "bw" : 24808,
        "iops" : 6202.059931,
        "runtime" : 30001,
        "total_ios" : 186068,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 37948,
          "max" : 22240351,
          "mean" : 104288.184212,
          "stddev" : 144548.391013
        },
        "clat_ns" : {
          "min" : 1987,
          "max" : 13087141,
          "mean" : 54753.480405,
          "stddev" : 123697.757456,
          "percentile" : {
            "1.000000" : 2096,
            "5.000000" : 2128,
            "10.000000" : 2128,
            "20.000000" : 2160,
            "30.000000" : 2192,
            "40.000000" : 2224,
            "50.000000" : 2288,
            "60.000000" : 2384,
            "70.000000" : 119296,
            "80.000000" : 129536,
            "90.000000" : 173056,
            "95.000000" : 181248,
            "99.000000" : 216064,
            "99.500000" : 228352,
            "99.900000" : 350208,
            "99.950000" : 921600,
            "99.990000" : 5472256
          }
        },
        "lat_ns" : {
          "min" : 119556,
          "max" : 22248514,
          "mean" : 159591.268520,
          "stddev" : 171900.751433
        },
        "bw_min" : 13884,
        "bw_max" : 24333,
        "bw_agg" : 80.366844,
        "bw_mean" : 19937.406780,
        "bw_dev" : 1227.047931,
        "bw_samples" : 59,
        "iops_min" : 3471,
        "iops_max" : 6083,
        "iops_mean" : 4984.101695,
        "iops_stddev" : 306.721804,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.916667,
      "sys_cpu" : 67.310000,
      "ctx" : 65481,
      "majf" : 0,
      "minf" : 13,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.010000,
        "4" : 65.555066,
        "10" : 0.237010,
        "20" : 0.059118,
        "50" : 0.023647,
        "100" : 0.034396,
        "250" : 33.794097,
        "500" : 0.221424,
        "750" : 0.011286,
        "1000" : 0.015586
      },
      "latency_ms" : {
        "2" : 0.011286,
        "4" : 0.019885,
        "10" : 0.013436,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1909166080,
        "io_kbytes" : 1864420,
        "bw_bytes" : 63636748,
        "bw" : 62145,
        "iops" : 15536.315456,
        "runtime" : 30001,
        "total_ios" : 466105,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4246,
          "max" : 14787595,
          "mean" : 47602.409069,
          "stddev" : 101947.451252
        },
        "clat_ns" : {
          "min" : 4706,
          "max" : 15637185,
          "mean" : 465859.332406,
          "stddev" : 362830.590427,
          "percentile" : {
            "1.000000" : 89600,
            "5.000000" : 90624,
            "10.000000" : 193536,
            "20.000000" : 209920,
            "30.000000" : 313344,
            "40.000000" : 374784,
            "50.000000" : 460800,
            "60.000000" : 544768,
            "70.000000" : 577536,
            "80.000000" : 593920,
            "90.000000" : 724992,
            "95.000000" : 897024,
            "99.000000" : 1171456,
            "99.500000" : 1286144,
            "99.900000" : 4292608,
            "99.950000" : 7962624,
            "99.990000" : 11337728
          }
        },
        "lat_ns" : {
          "min" : 124074,
          "max" : 15760467,
          "mean" : 513856.498971,
          "stddev" : 362779.379529
        },
        "bw_min" : 39904,
        "bw_max" : 67824,
        "bw_agg" : 99.868023,
        "bw_mean" : 62062.983051,
        "bw_dev" : 6562.647414,
        "bw_samples" : 59,
        "iops_min" : 9976,
        "iops_max" : 16956,
        "iops_mean" : 15515.711864,
        "iops_stddev" : 1640.672350,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 6.030000,
      "sys_cpu" : 74.120000,
      "ctx" : 44661,
      "majf" : 0,
      "minf" : 21,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998498,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999785,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 8.075434,
        "250" : 16.511516,
        "500" : 31.822873,
        "750" : 34.403407,
        "1000" : 5.985561
      },
      "latency_ms" : {
        "2" : 2.962852,
        "4" : 0.125937,
        "10" : 0.083887,
        "20" : 0.028320,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 649364,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 100570,
      "write_ticks" : 1,
      "in_queue" : 350,
      "util" : 99.220529
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=295: Sun Jan  3 15:50:07 2021
  read: IOPS=6202, BW=24.2MiB/s (25.4MB/s)(727MiB/30001msec)
    slat (usec): min=37, max=22240, avg=104.29, stdev=144.55
    clat (nsec): min=1987, max=13087k, avg=54753.48, stdev=123697.76
     lat (usec): min=119, max=22248, avg=159.59, stdev=171.90
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  120], 80.00th=[  130], 90.00th=[  174], 95.00th=[  182],
     | 99.00th=[  217], 99.50th=[  229], 99.90th=[  351], 99.95th=[  922],
     | 99.99th=[ 5473]
   bw (  KiB/s): min=13884, max=24333, per=80.37%, avg=19937.41, stdev=1227.05, samples=59
   iops        : min= 3471, max= 6083, avg=4984.10, stdev=306.72, samples=59
  lat (usec)   : 2=0.01%, 4=65.56%, 10=0.24%, 20=0.06%, 50=0.02%
  lat (usec)   : 100=0.03%, 250=33.79%, 500=0.22%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=3.92%, sys=67.31%, ctx=65481, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=186068,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=297: Sun Jan  3 15:50:07 2021
  read: IOPS=15.5k, BW=60.7MiB/s (63.6MB/s)(1821MiB/30001msec)
    slat (usec): min=4, max=14787, avg=47.60, stdev=101.95
    clat (usec): min=4, max=15637, avg=465.86, stdev=362.83
     lat (usec): min=124, max=15760, avg=513.86, stdev=362.78
    clat percentiles (usec):
     |  1.00th=[   90],  5.00th=[   91], 10.00th=[  194], 20.00th=[  210],
     | 30.00th=[  314], 40.00th=[  375], 50.00th=[  461], 60.00th=[  545],
     | 70.00th=[  578], 80.00th=[  594], 90.00th=[  725], 95.00th=[  898],
     | 99.00th=[ 1172], 99.50th=[ 1287], 99.90th=[ 4293], 99.95th=[ 7963],
     | 99.99th=[11338]
   bw (  KiB/s): min=39904, max=67824, per=99.87%, avg=62062.98, stdev=6562.65, samples=59
   iops        : min= 9976, max=16956, avg=15515.71, stdev=1640.67, samples=59
  lat (usec)   : 10=0.01%, 100=8.08%, 250=16.51%, 500=31.82%, 750=34.40%
  lat (usec)   : 1000=5.99%
  lat (msec)   : 2=2.96%, 4=0.13%, 10=0.08%, 20=0.03%
  cpu          : usr=6.03%, sys=74.12%, ctx=44661, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=466105,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=24.2MiB/s (25.4MB/s), 24.2MiB/s-24.2MiB/s (25.4MB/s-25.4MB/s), io=727MiB (762MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=60.7MiB/s (63.6MB/s), 60.7MiB/s-60.7MiB/s (63.6MB/s-63.6MB/s), io=1821MiB (1909MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=649364/1, merge=0/0, ticks=100570/1, in_queue=350, util=99.22%